// 正则校验
export const validator = {
  // 手机号码为11位，且以1开头
  phoneNo: '^1[0-9]{10}$',
  // 邮政编码
  postalCode: '^[0-9]{6}$',
  //固定电话
  telePhono: RegExp(/^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/),
  // 身份证号码为15位或者18位，15位时全为数字，18位前17位为数字，最后一位是校验位，可能为数字或字符X
  cardNo: RegExp(/(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/),
  // 统一社会信用代码
  socialCredit: `[0-9A-HJ-NPQRTUWXY]{2}([0-9]){6}[0-9A-HJ-NPQRTUWXY]{10}`,
  // socialCredit: `^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$`,
  password: '^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z\\W_]+$)(?![a-z0-9]+$)(?![a-z\\W_]+$)(?![0-9\\W_]+$)[a-zA-Z0-9\\W_]{8,18}$'
}
